In [29]:
import pandas as pd
import numpy as np

pop_num=pd.read_csv("population_number.csv", index_col="도시", encoding="euc-kr")
pop_num

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        NaN        NaN  3655437
인천  수도권  2890451  2632035.0        NaN  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990

In [5]:
pop_num.index

Index(['서울', '부산', '인천', '대구'], dtype='object', name='도시')

In [10]:
pop_num["2010"].sort_values(ascending=False)

도시
서울    9631482.0
인천    2632035.0
대구    2431774.0
부산          NaN
Name: 2010, dtype: float64

In [12]:
pop_num.sort_values(by=["2010"],ascending=False)

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
인천  수도권  2890451  2632035.0        NaN  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990
부산  경상권  3448737        NaN        NaN  3655437

In [25]:
pop_num.sort_values(by=["지역", "2010"])

     지역     2015       2010       2005     2000
도시
부산  경상권  3448737        0.0        0.0  3655437
대구  경상권  2466052  2431774.0  2456016.0  2473990
인천  수도권  2890451  2632035.0        0.0  2466338
서울  수도권  9904312  9631482.0  9762546.0  9853972

In [15]:
# 결측치 값을 0으로 채우기
pop_num.fillna(value=0)

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        0.0        0.0  3655437
인천  수도권  2890451  2632035.0        0.0  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990

In [19]:
pop_num.fillna(value=0, inplace=True)
pop_num

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        0.0        0.0  3655437
인천  수도권  2890451  2632035.0        0.0  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990

In [26]:
# colume 개수
pop_num.count()

지역      4
2015    4
2010    4
2005    4
2000    4
dtype: int64

In [27]:
# row 개수
pop_num.count(axis=1)

도시
서울    5
부산    5
인천    5
대구    5
dtype: int64

In [35]:
# serice class에서만 사용 하는 value_counts 입니다
s2=pd.Series(np.random.randint(10, size=100))
s2.value_counts()

6    14
9    13
2    12
8    11
1    11
4    10
7     9
5     8
0     7
3     5
Name: count, dtype: int64